app/Controllers/user/Artikelctrl.php

SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
---
    public function index()
    {
        $lang = session()->get('lang') ?? 'en';
        $data = [
            'lang' => $lang,
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),

SELECT *
FROM `tb_profil`
---
        }

        // Menentukan data artikel sesuai bahasa
        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'artikel' => [
                'judul_artikel' => $bahasa === 'en' ? $artikel->judul_artikel_en : $artikel->judul_artikel,
                'deskripsi_artikel' => $bahasa === 'en' ? $artikel->deskripsi_artikel_en : $artikel->deskripsi_artikel,
                'foto_artikel' => $artikel->foto_artikel,
                'created_at' => $artikel->created_at,
                'meta_title' => $bahasa === 'en' ? $artikel->meta_title_en : $artikel->meta_title_id,
                'meta_description' => $bahasa === 'en' ? $artikel->meta_description_en : $artikel->meta_description_id,
                'slug' => $bahasa === 'en' ? $artikel->slug_en : $artikel->slug_id,  // Menambahkan slug sesuai bahasa
            ],
            'artikel_lain' => $this->ArtikelModel->getArtikelLainnya($artikel->id_artikel, 4),
        ];