app/Controllers/user/Contactctrl.php

    public function index()
    {
        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
        ];
---
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`