app/Controllers/user/Homectrl.php

SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_aktivitas`
---
    public function index()
    {
        // Ambil bahasa dari sesi, default 'en'
        $lang = session()->get('lang') ?? 'en';


        // Dapatkan data profil, slider, produk, aktivitas, dan meta berdasarkan bahasa
        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'tbaktivitas' => $this->AktivitasModel->findAll(),
            'lang' => $lang,
            'meta' => $this->MetaModel->getMetaByPageName('Beranda'),
            'canonicalUrl' => base_url('/'),
            'Title' => $this->ProfilModel->findAll()[0]->title_website,
        ];