app/Controllers/user/Productsctrl.php

    public function detail($slug)
    {
        // Mengambil produk berdasarkan slug
        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbproduk' => $this->ProdukModel->where('slug_id', $slug)->orWhere('slug_en', $slug)->first(),
        ];

        // Cek apakah produk ditemukan
        if (!$data['tbproduk']) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Produk tidak ditemukan");
        }

       $produk =  $this->ProdukModel->where('slug_id', $slug)->orWhere('slug_en', $slug)->first();
---
SELECT *
FROM `tb_produk`
WHERE `slug_id` = 'desain-interior-restorasi-dan-renovasi'
OR `slug_en` = 'desain-interior-restorasi-dan-renovasi'
 LIMIT 1