app/Models/ArtikelModel.php

SELECT *
FROM `tb_artikel`
ORDER BY `id_artikel` DESC
---
    public function getArtikelTerbaru()
    {
        return $this->orderBy('id_artikel', 'desc')->findAll();

SELECT *
FROM `tb_artikel`
WHERE `id_artikel` != '9'
ORDER BY `id_artikel` ASC
---
    public function getArtikelLainnya($id_artikel, $limit = 4)
    {
        return $this->where('id_artikel !=', $id_artikel)
            ->orderBy('id_artikel', 'ASC')
            ->limit($limit)
            ->findAll();

SELECT *
FROM `tb_artikel`
WHERE `slug_id` = 'pt-archidesign-komitmen-terhadap-kualitas-dan-kepuasan-kli'
OR `slug_en` = 'pt-archidesign-komitmen-terhadap-kualitas-dan-kepuasan-kli'
 LIMIT 1
---
    public function getDetailArtikelBySlugId($slug_id)
    {
        // Mencari artikel berdasarkan slug_id
        $artikel = $this->where('slug_id', $slug_id)->orWhere('slug_en', $slug_id)->first();